export const categoryArr = [ 'men','women','accessories']

export const manTitle1 = ['粗獷','帥氣','陽光','瀟灑','時尚','講究','新潮','潮流','幹練','精明','霸氣','男神','帥哥','型男','軍用','總裁','文青','戰術','特勤','話題','拼接','日常','悠閒','居家','防水','創意','復古']
export const manTitle2 = ['西裝褲','西裝上衣','西裝外套','背心','襯衫','牛仔褲','外套','羽絨衣','帽Ｔ','防彈背心','夾克','皮衣','連帽夾克','工作褲','短袖上衣','風衣','牛仔外套']

export const womenTitle1 = ['甜美','可愛','甜心','俏皮','正妹','漂亮','火辣','優雅','氣質','話題','拼接','日常','悠閒','居家','防水','創意','復古','時尚','講究','新潮','潮流','文青']
export const womenTitle2 = ['洋裝','長裙','內搭褲','Ｔ桖','短裙','背心','毛衣','連衣裙','上衣','馬甲','盔甲','褲裙','造型褲','塑身褲','牛仔褲','A字裙','魚尾裙','紗裙','發熱衣','牛仔裙']

export const accessoriesTitle1 = ['亮眼','貴氣','氣質','優雅','時尚','百搭','土豪','潮流','品味','高檔','熱銷','話題','日常','悠閒','居家','防水','創意','復古','新潮']
export const accessoriesTitle2 = ['AppleWatch','浪琴表','勞力士','耳環','手環','項鍊','手鍊','腳環','鼻環','漁夫帽','鴨舌帽','貝雷帽','髮帶']

export const descriptionArr = ['熱銷中','搶購從速','適合穿搭','跑趴必備','上學專用','求生法寶','登山郊遊','實用性佳','顯瘦','修飾身材']

export const price = Math.floor(Math.random()*10000)

export const textureArr = ['棉','麻','絲','布','尼龍','人造纖維','聚酯纖維','嫘縈纖維','壓克力纖維','羊毛','蠶絲','天絲','合成樹脂','塑膠']

export const wash1 = ['手洗','機洗','乾洗']
export const wash2 = ['不可熨燙','可熨燙',`水溫${Math.floor(Math.random()*100)}度`]

export const placeArr = ['台灣','美國','韓國','日本','印尼','菲律賓','馬來西亞','荷蘭','瑞典','瑞士','德國','巴拿馬','馬達加斯加','巴布亞紐幾內亞']

export const noteArr = ['即將售完','熱銷中','火熱販賣中','好評熱銷中',"優惠中","火速進貨中","華麗滯銷中","跳樓拍賣中","促銷活動開跑"]

export const slotAArr = ['超耐磨','耐用','高磅數','最新款','經典款','復刻款','限量款','專利設計','搶眼設計','精緻設計']
export const slotBArr = ['跑趴','上學','上班','通勤','年長者','嬰幼兒','居家','辦公'] 
export const slotCArr = ['愛冒險','追求時尚','保守','喜歡復古風','講究玩樂','重視工作生活平衡','工程師','大氣不凡','追求卓越']

export const colorArr = [['胭脂','9d2933'],['品紅','f00056'],['绯红','c83c23'],['鵝黄','fff143'],['橙黃','ffa400'],['薑黃','ffc773'],['秋色','896c39'],['嫩綠','bddd22'],['竹青','789262'],['青葱','0aa344'],['草綠','40de5a'],['青翠','00e079'],['靛藍','065279'],['寶藍','4b5cc4'],['藏青','2e4e7e'],['群青','4c8dae'],['蒼黑','395260'],['蒼白','d1d9e0'],['象牙白',"fffbf0"],['黑色',"000000"],['墨色',"50616d"],['墨灰','758a99'],['赤金','f2be45']]
export const sizeArr = ["XS",'S','M','L','XL','2XL']


const picFolder = ""
const mainImg = ""
const images = []